<a href="https://colab.research.google.com/github/TranThanhDuoc/Github/blob/circleci-project-setup/Tran_Thanh_Duoc.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
from google.colab import files
uploaded = files.upload()

import pandas as pd
import datetime
import numpy as np
import io
TTD = pd.read_excel(io.BytesIO(uploaded['Superstore (updated).xls']))
TTD.head()

Saving Superstore (updated).xls to Superstore (updated).xls
WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero

   Row ID        Order ID Order Date  ... Quantity Discount    Profit
0       1  CA-2017-152156 2017-11-08  ...        2     0.00   41.9136
1       2  CA-2017-152156 2017-11-08  ...        3     0.00  219.5820
2       3  CA-2017-138688 2017-06-12  ...        2     0.00    6.8714
3       4  US-2016-108966 2016-10-11  ...        5     0.45 -383.0310
4       5  US-2016-108966 2016-10-11  ...        2     0.20    2.5164

[5 rows x 21 columns]

In [0]:
TTD['Year']=pd.DatetimeIndex(TTD['Order Date']).year
TTD['Quarter']=pd.DatetimeIndex(TTD['Order Date']).quarter
TTD['Month']=pd.DatetimeIndex(TTD['Order Date']).month
TTD.head()

   Row ID        Order ID Order Date  Ship Date  ...    Profit  Year Quarter Month
0       1  CA-2017-152156 2017-11-08 2017-11-11  ...   41.9136  2017       4    11
1       2  CA-2017-152156 2017-11-08 2017-11-11  ...  219.5820  2017       4    11
2       3  CA-2017-138688 2017-06-12 2017-06-16  ...    6.8714  2017       2     6
3       4  US-2016-108966 2016-10-11 2016-10-18  ... -383.0310  2016       4    10
4       5  US-2016-108966 2016-10-11 2016-10-18  ...    2.5164  2016       4    10

[5 rows x 24 columns]

Cau 1: Sort customer names in alphabetical order?

In [0]:
aa=TTD.sort_values('Customer Name')[0:5]
aa['Customer Name'][0:5]

8801    Aaron Bergman
4961    Aaron Bergman
4962    Aaron Bergman
4963    Aaron Bergman
8802    Aaron Bergman
Name: Customer Name, dtype: object

Cau 2: How many customers do we have?

In [0]:
TTD['Customer Name'].value_counts()

William Brown        37
Matt Abelman         34
Paul Prost           34
John Lee             34
Edward Hooks         32
                     ..
Lela Donovan          1
Carl Jackson          1
Ricardo Emerson       1
Jocasta Rupert        1
Anthony O'Donnell     1
Name: Customer Name, Length: 793, dtype: int64

In [0]:
TTD['Customer Name'].value_counts().reset_index()

                 index  Customer Name
0        William Brown             37
1         Matt Abelman             34
2           Paul Prost             34
3             John Lee             34
4         Edward Hooks             32
..                 ...            ...
788       Lela Donovan              1
789       Carl Jackson              1
790    Ricardo Emerson              1
791     Jocasta Rupert              1
792  Anthony O'Donnell              1

[793 rows x 2 columns]

Cau 3: What were the revenue?

In [0]:
TTD['Sales'].sum()

2297200.8603000003

Cau 4: What were our sales for the corporate segment? (What were our corporate sales?)

In [0]:
TTD.groupby('Segment')['Sales'].sum()

Segment
Consumer       1.161401e+06
Corporate      7.061464e+05
Home Office    4.296531e+05
Name: Sales, dtype: float64

In [0]:
TTD.groupby(TTD['Segment'] == 'Corporate')['Sales'].sum()

Segment
False    1.591054e+06
True     7.061464e+05
Name: Sales, dtype: float64

Cau 5: What were our sales by month in 2018?

In [0]:
TTD.groupby(['Month',TTD['Year']==2018]).aggregate({'Sales':'sum'})

                   Sales
Month Year
1     False   50953.4616
      True    43971.3740
2     False   39450.1180
      True    20301.1334
3     False  146133.1360
      True    58872.3528
4     False  101240.5925
      True    36521.5361
5     False  110767.7015
      True    44261.1102
6     False   99736.9536
      True    52981.7257
7     False  101973.6810
      True    45264.4160
8     False   95923.1750
      True    63120.8880
9     False  219783.2937
      True    87866.6520
10    False  122546.0615
      True    77776.9232
11    False  234013.2460
      True   118447.8250
12    False  241464.1847
      True    83829.3188

Thầy ơi em hông hiểu tại sao nó xuất hiện true, false. Em đoán là false là của các năm khác 2018. Làm sao để xóa False thầy ơi, chỉ em với?

Cau 6: What were sales in each state?

In [0]:
TTD.groupby('State')['Sales'].sum()

State
Alabama                  19510.6400
Arizona                  35282.0010
Arkansas                 11678.1300
California              457687.6315
Colorado                 32108.1180
Connecticut              13384.3570
Delaware                 27451.0690
District of Columbia      2865.0200
Florida                  89473.7080
Georgia                  49095.8400
Idaho                     4382.4860
Illinois                 80166.1010
Indiana                  53555.3600
Iowa                      4579.7600
Kansas                    2914.3100
Kentucky                 36591.7500
Louisiana                 9217.0300
Maine                     1270.5300
Maryland                 23705.5230
Massachusetts            28634.4340
Michigan                 76269.6140
Minnesota                29863.1500
Mississippi              10771.3400
Missouri                 22205.1500
Montana                   5589.3520
Nebraska                  7464.9300
Nevada                   16729.1020
New Hampshire             7292.5240
New Jersey               35764.3120
New Mexico                4783.5220
New York                310876.2710
North Carolina           55603.1640
North Dakota               919.9100
Ohio                     78258.1360
Oklahoma                 19683.3900
Oregon                   17431.1500
Pennsylvania            116511.9140
Rhode Island             22627.9560
South Carolina            8481.7100
South Dakota              1315.5600
Tennessee                30661.8730
Texas                   170188.0458
Utah                     11220.0560
Vermont                   8929.3700
Virginia                 70636.7200
Washington              138641.2700
West Virginia             1209.8240
Wisconsin                32114.6100
Wyoming                   1603.1360
Name: Sales, dtype: float64

Cau 7: What were the top 5 cities based on sales?

In [0]:
cau7=TTD.groupby('City').aggregate({'Sales':'sum'})
cau7.sort_values('Sales',ascending=False)[0:5].reset_index()

            City       Sales
0  New York City  256368.161
1    Los Angeles  175851.341
2        Seattle  119540.742
3  San Francisco  112669.092
4   Philadelphia  109077.013

Cau 8: How much profit did we make? By quarter?

In [0]:
TTD.sort_values('Profit').groupby(['Quarter','Year'])['Profit'].sum()

Quarter  Year
1        2015     3811.2290
         2016     9264.9416
         2017    11441.3708
         2018    23506.2026
2        2015    11204.0692
         2016    12190.9224
         2017    16390.3394
         2018    15499.2085
3        2015    12804.7218
         2016    16853.6194
         2017    15823.6048
         2018    26985.1325
4        2015    21723.9541
         2016    23309.1203
         2017    38139.8593
         2018    27448.7260
Name: Profit, dtype: float64

Cau 9: What was the average profit per year?

In [0]:
TTD.sort_values('Profit').groupby('Year')['Profit'].mean().reset_index()

   Year     Profit
0  2015  24.858994
1  2016  29.314274
2  2017  31.617771
3  2018  28.212340

Cau 10: Which orders had high profits?

In [0]:
cau10=TTD.groupby('Order ID').aggregate({'Sales':'sum'})
cau10.sort_values('Sales',ascending=False)[0:1]

                    Sales
Order ID
CA-2015-145317  23661.228

Cau 11: In California, what were the top 10 cities based on sales in 2018?

In [0]:
cau11=TTD[(TTD['State']=='California') & (TTD['Year']==2018)]
cau11a=cau11.groupby('City').aggregate({'Sales':'sum'})
cau11a.sort_values('Sales',ascending = False).head(10)

                       Sales
City
Los Angeles       48875.6925
San Francisco     37197.5510
San Diego          5635.5480
Sacramento         5325.8840
Brentwood          4229.9260
Oakland            3920.3860
Westminster        3826.6460
Inglewood          3479.3280
Long Beach         2762.9160
Huntington Beach   2495.8800

In [0]:
cau11=TTD[(TTD['State']=='California') & (TTD['Year']==2018)]
cau11.sort_values('Sales',ascending = False).groupby('City')['Sales'].sum().head(10)

City
Anaheim           2066.760
Apple Valley      1351.161
Bakersfield       1075.398
Brentwood         4229.926
Camarillo           14.730
Chico              753.112
Citrus Heights     129.390
Coachella          163.550
Concord           1869.378
Costa Mesa         782.206
Name: Sales, dtype: float64

Thầy ơi, giải thích giùm em sao có sự khác nhau giữa 2 cái code của câu 11 vậy thầy? Cộng với là em code câu 7, câu 10, câu 11 ý 2 giống nhau nhưng mà sao lại ra kết quả khác? Vì em chưa hiểu cấu trúc code nên chỉ đọc code và làm theo nên giờ hông biết?

Cau 12: Compare revenue and profit ratio for each category and subcategory?

In [0]:
cau12=TTD.groupby([TTD['Category'],TTD['Sub-Category']]).sum()
cau12['Ratio'] = cau12['Profit']/cau12['Sales']
print(cau12)

                               Row ID  Postal Code  ...  Month     Ratio
Category        Sub-Category                        ...
Furniture       Bookcases     1156535   12766131.0  ...   1745 -0.030228
                Chairs        3121503   34930821.0  ...   4979  0.080957
                Furnishings   4842624   51880430.0  ...   7544  0.142404
                Tables        1572664   18607828.0  ...   2524 -0.085645
Office Supplies Appliances    2407754   25245130.0  ...   3665  0.168675
                Art           3920109   43324250.0  ...   6002  0.240711
                Binders       7633935   83626398.0  ...  11860  0.148574
                Envelopes     1207903   13320323.0  ...   1991  0.422676
                Fasteners     1017287   12506063.0  ...   1696  0.313965
                Labels        1817254   19552985.0  ...   2779  0.444187
                Paper         6886090   76288405.0  ...  10710  0.433918
                Storage       4126649   46243312.0  ...   6669  0.095061
                Supplies       993554   10633558.0  ...   1502 -0.025477
Technology      Accessories   3928080   44457618.0  ...   6170  0.250547
                Copiers        355661    3873477.0  ...    534  0.371956
                Machines       561428    6364668.0  ...    897  0.017886
                Phones        4395985   47891767.0  ...   6783  0.134893

[17 rows x 10 columns]